V1/Data/linkerd-2/600-5-wrk2-n56rd.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 21.042ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 20.332ms, rate sampling interval: 63ms
  Thread calibration: mean lat.: 21.492ms, rate sampling interval: 65ms
  Thread calibration: mean lat.: 20.954ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 20.795ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 36.736ms, rate sampling interval: 86ms
  Thread calibration: mean lat.: 20.057ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 36.887ms, rate sampling interval: 83ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.70ms   16.29ms 190.85ms   93.35%
    Req/Sec    25.05     65.40   338.00     87.83%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   20.61ms
 75.000%   28.54ms
 90.000%   35.65ms
 99.000%   97.73ms
 99.900%  145.66ms
 99.990%  188.41ms
 99.999%  190.85ms
100.000%  190.98ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.939     0.000000            1         1.00
      10.783     0.100000         5809         1.11
      12.127     0.200000        11583         1.25
      14.175     0.300000        17360         1.43
      17.407     0.400000        23135         1.67
      20.607     0.500000        28907         2.00
      22.047     0.550000        31804         2.22
      23.519     0.600000        34689         2.50
      25.199     0.650000        37585         2.86
      26.831     0.700000        40486         3.33
      28.543     0.750000        43370         4.00
      29.439     0.775000        44807         4.44
      30.431     0.800000        46267         5.00
      31.487     0.825000        47713         5.71
      32.607     0.850000        49148         6.67
      33.919     0.875000        50589         8.00
      34.751     0.887500        51336         8.89
      35.647     0.900000        52055        10.00
      36.831     0.912500        52769        11.43
      38.399     0.925000        53490        13.33
      40.991     0.937500        54198        16.00
      43.199     0.943750        54565        17.78
      46.655     0.950000        54923        20.00
      52.095     0.956250        55283        22.86
      58.911     0.962500        55645        26.67
      67.071     0.968750        56008        32.00
      71.679     0.971875        56188        35.56
      76.095     0.975000        56366        40.00
      80.063     0.978125        56548        45.71
      83.967     0.981250        56729        53.33
      88.063     0.984375        56909        64.00
      90.495     0.985938        56999        71.11
      93.055     0.987500        57089        80.00
      95.999     0.989062        57179        91.43
      98.751     0.990625        57271       106.67
     101.823     0.992188        57360       128.00
     104.063     0.992969        57405       142.22
     106.943     0.993750        57450       160.00
     109.119     0.994531        57495       182.86
     112.575     0.995313        57541       213.33
     116.287     0.996094        57586       256.00
     118.783     0.996484        57608       284.44
     122.687     0.996875        57632       320.00
     126.207     0.997266        57653       365.71
     130.687     0.997656        57676       426.67
     134.143     0.998047        57699       512.00
     136.063     0.998242        57710       568.89
     138.367     0.998437        57722       640.00
     140.159     0.998633        57733       731.43
     142.591     0.998828        57745       853.33
     146.303     0.999023        57755      1024.00
     150.015     0.999121        57761      1137.78
     154.111     0.999219        57767      1280.00
     156.927     0.999316        57772      1462.86
     161.407     0.999414        57778      1706.67
     166.015     0.999512        57783      2048.00
     167.167     0.999561        57787      2275.56
     171.007     0.999609        57789      2560.00
     174.335     0.999658        57792      2925.71
     177.279     0.999707        57795      3413.33
     185.087     0.999756        57797      4096.00
     186.239     0.999780        57799      4551.11
     186.751     0.999805        57800      5120.00
     187.263     0.999829        57802      5851.43
     188.031     0.999854        57803      6826.67
     188.287     0.999878        57804      8192.00
     188.415     0.999890        57805      9102.22
     188.927     0.999902        57806     10240.00
     189.567     0.999915        57807     11702.86
     189.567     0.999927        57807     13653.33
     189.695     0.999939        57808     16384.00
     189.695     0.999945        57808     18204.44
     190.591     0.999951        57809     20480.00
     190.591     0.999957        57809     23405.71
     190.591     0.999963        57809     27306.67
     190.847     0.999969        57810     32768.00
     190.847     0.999973        57810     36408.89
     190.847     0.999976        57810     40960.00
     190.847     0.999979        57810     46811.43
     190.847     0.999982        57810     54613.33
     190.975     0.999985        57811     65536.00
     190.975     1.000000        57811          inf
#[Mean    =       23.698, StdDeviation   =       16.293]
#[Max     =      190.848, Total count    =        57811]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59958 requests in 5.00m, 22.13MB read
Requests/sec:    199.84
Transfer/sec:     75.53KB